

Router>en
Router#config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface gig
Router(config)#interface gigabitEthernet 0/0
Router(config-if)#ip address 192.168.11.1 255.255.255.0
Router(config-if)#exit
Router(config)#interface serial
Router(config)#interface serial 0/1/0
%Invalid interface type and number
Router(config)#interface seria
Router(config)#interface serial 0/0/0
Router(config-if)#ip address 10.0.0.2 255.0.0.0
Router(config-if)#ip route 0.0.0.0 0.0.0.0 10.0.0.0
Router(config)#no shutdown
                   ^
% Invalid input detected at '^' marker.
	
Router(config)#interface serial 0/0/0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface Serial0/0/0, changed state to up

Router(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0/0, changed state to up
exit
Router(config)#interface gig
Router(config)#interface gigabitEthernet 0/0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#copy running
Router#copy running-config start
Router#copy running-config startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]
Router#
