Router>en
Router#config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface gig0/0
%Invalid interface type and number
Router(config)#interface gig
Router(config)#interface gigabitEthernet 
% Incomplete command.
Router(config)#interface gigabitEthernet 0/0
%Invalid interface type and number
Router(config)#interface fas 0/0
Router(config)#interface f 0/0
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#interface f 0/1
%Invalid interface type and number
Router(config)#interface f 1/0
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet1/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to up
exit
Router(config)#router rip
Router(config-router)#exit
Router(config)#interface f 0/0
Router(config-if)#ip helper-
Router(config-if)#ip helper-address 192.168.2.2
Router(config-if)#
